       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXERCISE3.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *CON VALUE PODEMOS DARLE A LAS VARIABLES UN VALOR DE ENTRADA
       01  PASSWORD-OLD PICTURE IS X(10) VALUE "ROBERTO".
       01  PASSWORD-NEW PIC X(10).

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           DISPLAY "LA CONTRASEÑA VIEJA ES: ", PASSWORD-OLD.
           DISPLAY "INGRESE LA CONTRASEÑA NUEVA: ".
           ACCEPT PASSWORD-NEW.
           MOVE PASSWORD-NEW TO PASSWORD-OLD.
           DISPLAY PASSWORD-OLD.

       PROGRAM-DONE.
           STOP RUN.
