       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXERCISE.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  FIRST-NUMBER PIC 9(2).
       01  SECOND-NUMBER PIC 9(2).
       01  RESULT PIC 9(3).

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           DISPLAY "SUMA DE DOS NÚMEROS".
           DISPLAY "INGRESE EL PRIMER NÚMERO: ".
           ACCEPT FIRST-NUMBER.
           DISPLAY "INGRESE EL SEGUNDO NÚMERO".
           ACCEPT SECOND-NUMBER.
           COMPUTE RESULT = FIRST-NUMBER + SECOND-NUMBER.
           DISPLAY "EL RESULTADO DE LA SUMA ES: ", RESULT.

       PROGRAM-DONE.
           STOP RUN.
