       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXERCISE4.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  CONTADOR PIC 9(1) VALUE 1.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           ADD 1 TO CONTADOR.
           DISPLAY CONTADOR.
       PROGRAM-DONE.
           STOP RUN.
