       IDENTIFICATION DIVISION.
       PROGRAM-ID. EJEMPLO.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  SUMA PIC 9(4) VALUE 0.
       01  CONTADOR PIC 9(2) VALUE 1.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           PERFORM SUMAR-NUMEROS
               VARYING CONTADOR FROM 1 BY 1 UNTIL CONTADOR > 10.
           DISPLAY "LA SUMA DE LOS NÚMEROS DEL 1 AL 10 ES: ", SUMA.
           STOP RUN.
           SUMAR-NUMEROS.
               ADD CONTADOR TO SUMA.
