       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENDO COBOL9".

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01  MENSAJE PIC X(50).
       01  NUMERO PIC 9(2).

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           MOVE 1 TO NUMERO.
           MOVE "JACK THE MIMBLE" TO MENSAJE.
           DISPLAY NUMERO " " MENSAJE.
           ADD 1 TO NUMERO.
           DISPLAY NUMERO " " MENSAJE.

       PROGRAM-DONE.
           STOP RUN.
