       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENDO COBOL51".

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NOM-ESTUDIANTE PIC X(20).
       01  NOTA-MAT PIC S99.
       01  NOTA-ING PIC S99.
       01  PROMEDIO PIC 99.99.

       PROCEDURE DIVISION.

       INGRESAR-DATOS.
           DISPLAY "NOMBRE: ".
           ACCEPT NOM-ESTUDIANTE.
       CARGAR-NOTAS-MAT.
           DISPLAY "NOTA DE MATEMÁTICAS: ".
           ACCEPT NOTA-MAT.
       CARGAR-NOTAS-ING.
           DISPLAY "NOTA DE INGLÉS: ".
           ACCEPT NOTA-ING.
       VALIDACION.
           IF NOTA-MAT < 0 OR NOTA-MAT > 10
               DISPLAY "NOTA INVALIDA! VUELVA A INGRESARLAS!"
               PERFORM CARGAR-NOTAS-MAT.
           IF NOTA-ING < 0 OR NOTA-ING > 10
               DISPLAY "NOTA INVALIDA! VUELVA A INGRESARLAS!"
               PERFORM CARGAR-NOTAS-ING.
       CALCULO.
           COMPUTE PROMEDIO = (NOTA-MAT + NOTA-ING) / 2.
       MOSTRAR.
           DISPLAY "ESTUDIANTE ", NOM-ESTUDIANTE.
           DISPLAY "MATEMÁTICAS: ", NOTA-MAT.
           DISPLAY "INGLÉS: ", NOTA-ING.
           DISPLAY "PROMEDIO ESTUDIANTIL: ", PROMEDIO.
       FIN.
           STOP RUN.
