       IDENTIFICATION DIVISION.

       PROGRAM-ID. "APRENDIENDO COBOL".

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  MENSAJE PIC X(10).

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           MOVE "HOLA MUNDO" TO MENSAJE.
           DISPLAY MENSAJE.
       PROGRAM-DONE.
           STOP RUN.
