       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENDO COBOL19".

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  FECHA PIC 9(8).
       01  FECHA-EDITADA PIC 9999/99/99.

       PROCEDURE DIVISION.
       INICIO.
       MOVER.
           MOVE 20230203 TO FECHA.
           MOVE FECHA TO FECHA-EDITADA.
       IMPRIMIR.
           DISPLAY "HOY ES: ", FECHA-EDITADA.
       FIN.
           STOP RUN.
