       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENCO COBOL37".

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  CADENA1 PIC X(10) VALUE "ALBINO".
       01  CADENA2 PIC X(10) VALUE "OSO".

       PROCEDURE DIVISION.
       INICIO.
           DISPLAY "MAX CADENA: ",FUNCTION MAX(CADENA1, CADENA2).
           DISPLAY "MIN CADENA: ",FUNCTION MIN(CADENA1, CADENA2).

       FIN.
           STOP RUN.
