       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENDO COBOL55".

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  NUM-ESTUDIANTE PIC 99.
       77  NOTAS-TOTAL PIC 9999V9.
       77  PROMEDIO PIC Z9.9.
       01  LISTA-NOTAS.
           05  NOTAS OCCURS 5 TIMES PIC 99V9.

       PROCEDURE DIVISION.
       INICIO.
           DISPLAY "INGRESE LAS NOTAS DE LOS ESTUDIANTES!".
           MOVE 0 TO NOTAS-TOTAL.
           PERFORM AGREGAR-EN-NOTAS VARYING NUM-ESTUDIANTE FROM 1 BY 1
               UNTIL NUM-ESTUDIANTE = 6.
           COMPUTE PROMEDIO = NOTAS-TOTAL / 5.
           DISPLAY "EL PROMEDIO DE LAS NOTAS ES: ", PROMEDIO.

           STOP RUN.

       AGREGAR-EN-NOTAS.
           ACCEPT NOTAS(NUM-ESTUDIANTE).
           ADD NOTAS(NUM-ESTUDIANTE) TO NOTAS-TOTAL.
