       IDENTIFICATION DIVISION.

       PROGRAM-ID. "APRENDIENDO COBOL7".

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  NAME PICTURE IS XXXXXXX.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           DISPLAY "INGRESE ALGÚN NOMBRE: ".
           ACCEPT NAME.
           DISPLAY "EL NOMBRE INGRESADO ES: " NAME.

       PROGRAM-DONE.
           STOP RUN.
