       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENDO COBOL18".

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  PRECIO PIC 99.
       01  PRECIO-EDITADO PIC $99.

       PROCEDURE DIVISION.
       INICIO.
       MOVER.
           MOVE 48 TO PRECIO.
           MOVE PRECIO TO PRECIO-EDITADO.
       IMPRIMIR.
           DISPLAY PRECIO.
           DISPLAY PRECIO-EDITADO.

       FIN.
           STOP RUN.
