       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENDO COBOL25".

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  FIRST-NAME PIC X(10) VALUE "ELIAS".
       01  LAST-NAME PIC X(10) VALUE "PEREZ".
       01  FULL-NAME PIC X(20).

       PROCEDURE DIVISION.
       INICIO.
           STRING
           FIRST-NAME DELIMITED BY SPACE " " DELIMITED BY SIZE
           LAST-NAME DELIMITED BY SPACE
           INTO FULL-NAME
           END-STRING.
           DISPLAY FULL-NAME.


       FIN.
           STOP RUN.
