       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENDO COBOL2".
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           DISPLAY "CONSTANTES NUMERICAS".
           DISPLAY 12345.
       PROGRAM-DONE.
           STOP RUN.
