       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENDO COBOL54".

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  NUM-ESTUDIANTE PIC 99.
       77  NOTAS-SALIDA PIC BBZ9.9.
       01  LISTA-NOTAS.
           05  NOTAS OCCURS 5 TIMES PIC 99V9.

       PROCEDURE DIVISION.
       INICIO.
           DISPLAY "INGRESE LAS NOTAS DE LOS ESTUDIANTES".
           PERFORM INGRESO-NOTAS VARYING NUM-ESTUDIANTE FROM 1 BY 1
               UNTIL NUM-ESTUDIANTE = 4 .
           PERFORM SALIDA-NOTAS VARYING NUM-ESTUDIANTE FROM 1 BY 1
               UNTIL NUM-ESTUDIANTE = 4.
           STOP RUN.
       INGRESO-NOTAS.
           ACCEPT NOTAS(NUM-ESTUDIANTE).
       SALIDA-NOTAS.
           MOVE NOTAS(NUM-ESTUDIANTE) TO NOTAS-SALIDA.
           DISPLAY NUM-ESTUDIANTE, NOTAS-SALIDA.
