       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENDO COBOL38".

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUM1 PIC 9(2).
       01  NUM2 PIC 9(2).
       01  RESULTADO-INICIAL PIC 999.
       01  RESULTADO-FINAL PIC 99.
       01  BANDERA PIC X VALUE "N".

       PROCEDURE DIVISION.
       INICIO.
           MOVE 56 TO NUM1.
           MOVE 78 TO NUM2.
           ADD NUM1 TO NUM2
               GIVING RESULTADO-INICIAL.
           DISPLAY "RESULTADO INICIAL: ", RESULTADO-INICIAL.
           ADD NUM1 TO NUM2
               GIVING RESULTADO-FINAL
                   ON SIZE ERROR
                   DISPLAY "EXCESO DE CAPACIDAD".
                   PERFORM OVER-FLOW.
           IF BANDERA = "N"
               DISPLAY "RESULTADO CORRECTO: ", RESULTADO-FINAL
           END-IF.
           STOP RUN.
      *LOS ERRORES DE TAMAÑO NO NECESARIAMENTE PRODUCEN UN TRUNCAMIENTO
      *A VECES HACE QUE SE GUARDEN VALORES IMPREDECIBLES.
           OVER-FLOW.
           MOVE "Y" TO BANDERA.
           DISPLAY "RESULTADO TRUNCADO: ", RESULTADO-FINAL.

       FIN.
