       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENDO COBOL28".

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NOMBRE PIC X(10) VALUE "ELIAS".
       01  APELLIDO PIC X(10) VALUE "PEREZ".
       01  NOMBRE-COMPLETO PIC X(20).

       PROCEDURE DIVISION.
       INICIO.
      *DIFERENCIA ENTRE DELIMITED BY SPACE.
           STRING
           NOMBRE DELIMITED BY SIZE APELLIDO
           INTO NOMBRE-COMPLETO
           END-STRING.
           DISPLAY NOMBRE-COMPLETO.
       FIN.
           STOP RUN.
