       IDENTIFICATION DIVISION.
       PROGRAM-ID. REDEFINES-EXAMPLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  ORIGINAL-DATA.
           05 FIELD-1 PIC X(5) VALUE 'ABCDE'.
           05 FIELD-2 PIC X(5) VALUE '12345'.
       01 REDEFINED-DATA REDEFINES ORIGINAL-DATA.
           05 COMBINED-FIELD PIC X(10).

       PROCEDURE DIVISION.
           DISPLAY 'Campo original 1: ' FIELD-1.
           DISPLAY 'Campo original 2: ' FIELD-2.
           DISPLAY 'Campo combinado: ' COMBINED-FIELD.
       STOP RUN.
