      *USO DE THRU PARA ESPECIFICAR UN RANGO DE PARRAFOS
       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENDO COBOL22".

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  NUM1 PIC 9.
       01  NUM2 PIC 9.
       01  RESULT PIC 99.

       PROCEDURE DIVISION.
       INICIO.
           DISPLAY "INGRESE EL PRIMER NÚMERO: ".
           ACCEPT NUM1.
           DISPLAY "INGRESE EL SEGUNDO NÚMERO: ".
           ACCEPT NUM2.

           PERFORM SUMA THRU MULTIPLICACION.
           STOP RUN.
       SUMA.
           COMPUTE RESULT = NUM1 + NUM2.
           DISPLAY "EL RESULTADO DE LA SUMA ES: ", RESULT.
       RESTA.
           COMPUTE RESULT = NUM1 - NUM2.
           DISPLAY "EL RESULTADO DE LA RESTA ES: ", RESULT.
       MULTIPLICACION.
           COMPUTE RESULT = NUM1 * NUM2.
           DISPLAY "EL RESULTADO DE LA MULTIPLICACIÓN ES: ", RESULT.

       FIN.
