       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENDO COBOL52".

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  DETALLES-STAFF.
           05  NOMBRE-STAFF PIC A(20).
           05  PAGO-ANUAL PIC 9(5).
           05  PAGO-SEMANAL PIC 9(3).

       PROCEDURE DIVISION.
       INICIO.
           PERFORM CONSEGUIR-DETALLES-STAFF THRU MOSTRAR-NOMINA.
           STOP RUN.
       CONSEGUIR-DETALLES-STAFF.
           DISPLAY "NOMBRE: ". ACCEPT NOMBRE-STAFF.
           DISPLAY "PAGO ANUAL (SOLO 5 DÍGITOS): ". ACCEPT PAGO-ANUAL.
       CALCULAR-PAGO-SEMANAL.
           DIVIDE PAGO-ANUAL BY 52 GIVING PAGO-SEMANAL ROUNDED.
       MOSTRAR-NOMINA.
           DISPLAY '****************************************'
           DISPLAY 'NOMBRE DEL STAFF: ', NOMBRE-STAFF.
           DISPLAY 'PAGO SEMANAL: ', PAGO-SEMANAL.
           DISPLAY '****************************************'.
