       IDENTIFICATION DIVISION.
       PROGRAM-ID. "HOLA MUNDO".
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           DISPLAY "HOLA MUNDO".
       PROGRAM-DONE.
           STOP RUN.
