       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXERCISE2.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  MENSAJE PIC X(30).

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
      *PUEDO USAR WITH NO ADVANCING PARA EVITAR EL SALTO DE LINEA.
           DISPLAY "INGRESE UNA" WITH NO ADVANCING.
           DISPLAY " FRASE: ".
           ACCEPT MENSAJE.
           DISPLAY MENSAJE.



       PROGRAM-DONE.
           STOP RUN.
