       IDENTIFICATION DIVISION.
       PROGRAM-ID. "APRENDIENDO COBOL".
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           DISPLAY "BIENVENIDOS A MI PROGRAMA COBOL!".
           DISPLAY "POR UN MEJOR FUTURO.".
       PROGRAM-DONE.
           STOP RUN.
