      *Escribe un programa que muestre por pantalla "Hola mundo!"

       IDENTIFICATION DIVISION.
       PROGRAM-ID. HOLA-MUNDO.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
           DISPLAY "Hola mundo!".
           STOP RUN.
